Res-firecracker-setEven-randomFront-v7/firecracker_t_10_c_30_frontVcpu_2_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 5215.904ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 5002.056ms, rate sampling interval: 17596ms
  Thread calibration: mean lat.: 4816.741ms, rate sampling interval: 17235ms
  Thread calibration: mean lat.: 5008.314ms, rate sampling interval: 17629ms
  Thread calibration: mean lat.: 5264.450ms, rate sampling interval: 18186ms
  Thread calibration: mean lat.: 4733.769ms, rate sampling interval: 16957ms
  Thread calibration: mean lat.: 4865.139ms, rate sampling interval: 17645ms
  Thread calibration: mean lat.: 5038.615ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 4894.460ms, rate sampling interval: 17530ms
  Thread calibration: mean lat.: 5083.832ms, rate sampling interval: 17727ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    29.12s    11.20s    0.95m    67.10%
    Req/Sec   235.35      4.62   243.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.84s 
 75.000%   35.68s 
 90.000%   43.94s 
 99.000%    0.95m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    0.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8880.127     0.000000            2         1.00
   14548.991     0.100000        11792         1.11
   18776.063     0.200000        23581         1.25
   22282.239     0.300000        35403         1.43
   25608.191     0.400000        47189         1.67
   28835.839     0.500000        58977         2.00
   30343.167     0.550000        64846         2.22
   31670.271     0.600000        70767         2.50
   32948.223     0.650000        76662         2.86
   34242.559     0.700000        82517         3.33
   35684.351     0.750000        88451         4.00
   36536.319     0.775000        91402         4.44
   37519.359     0.800000        94365         5.00
   38993.919     0.825000        97311         5.71
   40337.407     0.850000       100216         6.67
   41910.271     0.875000       103177         8.00
   42762.239     0.887500       104671         8.89
   43941.887     0.900000       106123        10.00
   45711.359     0.912500       107590        11.43
   47513.599     0.925000       109060        13.33
   49315.839     0.937500       110532        16.00
   50200.575     0.943750       111253        17.78
   51216.383     0.950000       111988        20.00
   52101.119     0.956250       112739        22.86
   52985.855     0.962500       113477        26.67
   53837.823     0.968750       114197        32.00
   54296.575     0.971875       114572        35.56
   54788.095     0.975000       114939        40.00
   55246.847     0.978125       115320        45.71
   55803.903     0.981250       115685        53.33
   56295.423     0.984375       116056        64.00
   56524.799     0.985938       116236        71.11
   56754.175     0.987500       116409        80.00
   57081.855     0.989062       116595        91.43
   57475.071     0.990625       116787       106.67
   57802.751     0.992188       116973       128.00
   57933.823     0.992969       117052       142.22
   58163.199     0.993750       117153       160.00
   58359.807     0.994531       117255       182.86
   58589.183     0.995313       117339       213.33
   58720.255     0.996094       117429       256.00
   58818.559     0.996484       117478       284.44
   58916.863     0.996875       117524       320.00
   59015.167     0.997266       117558       365.71
   59113.471     0.997656       117608       426.67
   59211.775     0.998047       117660       512.00
   59244.543     0.998242       117678       568.89
   59310.079     0.998437       117719       640.00
   59310.079     0.998633       117719       731.43
   59375.615     0.998828       117752       853.33
   59408.383     0.999023       117777      1024.00
   59408.383     0.999121       117777      1137.78
   59441.151     0.999219       117799      1280.00
   59473.919     0.999316       117812      1462.86
   59473.919     0.999414       117812      1706.67
   59506.687     0.999512       117826      2048.00
   59539.455     0.999561       117837      2275.56
   59539.455     0.999609       117837      2560.00
   59572.223     0.999658       117856      2925.71
   59572.223     0.999707       117856      3413.33
   59572.223     0.999756       117856      4096.00
   59572.223     0.999780       117856      4551.11
   59604.991     0.999805       117873      5120.00
   59604.991     0.999829       117873      5851.43
   59604.991     0.999854       117873      6826.67
   59604.991     0.999878       117873      8192.00
   59604.991     0.999890       117873      9102.22
   59604.991     0.999902       117873     10240.00
   59604.991     0.999915       117873     11702.86
   59604.991     0.999927       117873     13653.33
   59604.991     0.999939       117873     16384.00
   59637.759     0.999945       117879     18204.44
   59637.759     0.999951       117879     20480.00
   59637.759     0.999957       117879     23405.71
   59637.759     0.999963       117879     27306.67
   59637.759     0.999969       117879     32768.00
   59637.759     0.999973       117879     36408.89
   59637.759     0.999976       117879     40960.00
   59637.759     0.999979       117879     46811.43
   59637.759     0.999982       117879     54613.33
   59637.759     0.999985       117879     65536.00
   59637.759     0.999986       117879     72817.78
   59637.759     0.999988       117879     81920.00
   59637.759     0.999989       117879     93622.86
   59637.759     0.999991       117879    109226.67
   59670.527     0.999992       117880    131072.00
   59670.527     1.000000       117880          inf
#[Mean    =    29115.991, StdDeviation   =    11199.741]
#[Max     =    59637.760, Total count    =       117880]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  140620 requests in 1.00m, 58.11MB read
  Socket errors: connect 0, read 0, write 0, timeout 47
Requests/sec:   2343.33
Transfer/sec:      0.97MB